app/controllers/artists_controller.rb

  def show
    if @artist = Artist.find_by_id(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]